[
  {
    "version": "0.2.3",
    "slug": "v0-2-3-save-editor-and-schema-migration",
    "date": "2025-11-10",
    "title": "v0.2.3 — Save Editor & Schema Migration",
    "description": "This patch introduces a powerful Save Editor tool for advanced users and implements an important save-file schema migration for improved naming consistency. The editor allows manual customization of all game values, while the migration system ensures backward compatibility with older saves.",
    "changes": [
      "Added full Save Editor page with import/export and manual customization",
      "Migrated save-file keys: followers→creds, shards→awards, reputation→prestige",
      "Automatic save-migration for backward compatibility",
      "Save Editor now theme-compatible (warning box remains red regardless of theme)"
    ]
  },
  {
    "version": "0.1.0",
    "slug": "v0-1-0-initial-release",
    "date": "2025-11-01",
    "title": "Initial Release - Early Access",
    "description": "Our first public release! Clickfluencer Idle arrives with core gameplay systems, multiple generators, and responsive UI design to kickstart your influencer empire.",
    "changes": [
      "Launch of Clickfluencer Idle",
      "Core clicking mechanics with satisfying feedback",
      "6 content generators (Social Media Manager, Content Creator, etc.)",
      "Multiple permanent upgrades to boost production",
      "9 unlockable themes with unique visual styles",
      "Prestige system for long-term progression",
      "Offline earnings - keep growing while away",
      "Local save system with export/import functionality",
      "Fully responsive design for desktop and mobile",
      "No login required - purely browser-based gameplay"
    ]
  },
  {
    "version": "0.1.1",
    "slug": "v0-1-1-ui-gameplay-upgrades",
    "date": "2025-11-02",
    "title": "UI & Gameplay Upgrades",
    "description": "Our first minor patch! In this patch, we focused on improving the user interface and adding new gameplay upgrades to enhance your experience.",
    "changes": [
      "Added Prestige display to the currency bar at all levels, showing at the start of the bar in both desktop and mobile views",
      "Added dismiss (X) button to event toasts — can be closed visually without interrupting the running event",
      "Upgrades now merge automatically (like theme merges) so new upgrades appear without requiring data resets",
      "Adjusted upgrade costs for better progression balance",
      "Lucky Charm cost scaling changed from ×10 to ×15 per tier for smoother pacing",
      "Overnight Success cost scaling increased to ×5, starting at 25,000 creds",
      "Cred Cache scaling increased to ×5 per tier, up to 31,250,000 for tier 6",
      "Infinite upgrades (AI Enhancements, Better Filters) now appear at the top of the shop list",
      "Removed Light theme's bonus multiplier and updated its description to reflect neutral balance",
      "Quick Stats simplified — now only shows Total Clicks and Score; Prestige level moved to currency bar",
      "Version updated to v0.2.0 Early Access for live branch claude/ui-upgrades-and-fixes-011CUiaKNaUaZCiPk3amDLrU",
      "Build verified successfully with no errors or data resets"
    ]
  },
  {
    "version": "0.2.0",
    "slug": "v0-2-0-layout-overhaul-achievements",
    "date": "2025-11-09",
    "title": "v0.2.0 — Start Page, Layout Overhaul, Achievements, and Notoriety Stores",
    "description": "Major update introducing a new unified layout, achievements system, and revamped upgrade stores to enhance gameplay and user experience.",
    "changes": [
      "Implemented new unified layout with desktop sidebar and mobile slide-up bottom nav",
      "Achievements tab added next to Themes with placeholder trophies (per save slot)",
      "Split Upgrades tab into Cred Store and Notoriety Store sections",
      "Applied monospace fonts to all stat and currency values",
      "Introduced theme support for custom fonts, background, and icon images",
      "Added Buy Me a Coffee donation link in Settings",
      "Prestige threshold lowered to 1e7, preserving Themes, Infinite upgrades, and Achievements",
      "Random events rebalanced to occur roughly every 10 minutes",
      "Improved ×10 purchase feedback and disabled state"
    ]
  },
  {
    "version": "0.2.1",
    "slug": "v0-2-1-polish-and-prestige-prep",
    "date": "2025-11-09",
    "title": "v0.2.1 — Polish, Presentation, and Prestige Prep",
    "description": "This patch focuses on presentation, UX clarity, and improving the first impression for both new and returning players. With a brand-new hero splash, marquee news bar, and deeper page structure, Clickfluencer Idle now feels more like a living web app than ever. Creds logic also received a crucial update—your displayed rate now accurately reflects notoriety upkeep costs, helping you make smarter economic decisions on your influencer journey.",
    "changes": [
      "Added a live marquee news bar under the navigation with pause-on-hover behavior and clickable links to individual news posts",
      "Overhauled the News system — now presented as a chronological stream with dedicated detail pages for each version",
      "Added unique slugs for news entries and structured changelogs with titles, dates, and developer notes for easier browsing",
      "Revised the Guide and About pages with expanded sections, cleaner formatting, and improved flow between key content areas",
      "Introduced a themed \"splash\" hero section on the home page, complete with guide and update call-to-action buttons and a smooth scroll-to-game transition",
      "Adjusted core economy display — the Creds +X.Y/s indicator now reflects notoriety upkeep, showing your true net gain per second",
      "Improved page structure consistency and alignment across all routes (Home, Guide, About, News)",
      "Minor polish to font rendering and color transitions for better legibility across themes",
      "Set groundwork for future expansion systems and prestige reworks coming in v0.3.0"
    ]
  },
  {
    "version": "0.2.2",
    "slug": "v0-2-2-theme-and-prestige-fixes",
    "date": "2025-11-09",
    "title": "v0.2.2 — ThemeVV and Prestige Fix",
    "description": "A quick fix addressing a minor issue with the ThemeVV identifier to ensure proper functionality and consistency within the game. Further updates to ensure prestige system resets currency correctly.",
    "changes": [
      "Corrected the ThemeVV theme ID from 'themeVV' to 'themevv' to maintain consistency with naming conventions and ensure proper theme application",
      "Fixed an issue where prestige resets were not correctly resetting the player's currency, ensuring a proper restart of the economic progression upon prestiging",
      "Infinite upgrades are no longer finite."
    ]
  }
]