[
  {
    "version": "0.1.0",
    "slug": "v0-1-0-initial-release",
    "date": "2025-11-01",
    "title": "Initial Release - Early Access",
    "description": "Our first public release! Clickfluencer Idle arrives with core gameplay systems, multiple generators, and responsive UI design to kickstart your influencer empire.",
    "changes": [
      "Launch of Clickfluencer Idle",
      "Core clicking mechanics with satisfying feedback",
      "6 content generators (Social Media Manager, Content Creator, etc.)",
      "Multiple permanent upgrades to boost production",
      "9 unlockable themes with unique visual styles",
      "Prestige system for long-term progression",
      "Offline earnings - keep growing while away",
      "Local save system with export/import functionality",
      "Fully responsive design for desktop and mobile",
      "No login required - purely browser-based gameplay"
    ]
  },
  {
    "version": "0.1.1",
    "slug": "v0-1-1-ui-gameplay-upgrades",
    "date": "2025-11-02",
    "title": "UI & Gameplay Upgrades",
    "description": "Our first minor patch! In this patch, we focused on improving the user interface and adding new gameplay upgrades to enhance your experience.",
    "changes": [
      "Added Prestige display to the currency bar at all levels, showing at the start of the bar in both desktop and mobile views",
      "Added dismiss (X) button to event toasts — can be closed visually without interrupting the running event",
      "Upgrades now merge automatically (like theme merges) so new upgrades appear without requiring data resets",
      "Adjusted upgrade costs for better progression balance",
      "Lucky Charm cost scaling changed from ×10 to ×15 per tier for smoother pacing",
      "Overnight Success cost scaling increased to ×5, starting at 25,000 creds",
      "Cred Cache scaling increased to ×5 per tier, up to 31,250,000 for tier 6",
      "Infinite upgrades (AI Enhancements, Better Filters) now appear at the top of the shop list",
      "Removed Light theme's bonus multiplier and updated its description to reflect neutral balance",
      "Quick Stats simplified — now only shows Total Clicks and Score; Prestige level moved to currency bar",
      "Version updated to v0.2.0 Early Access for live branch claude/ui-upgrades-and-fixes-011CUiaKNaUaZCiPk3amDLrU",
      "Build verified successfully with no errors or data resets"
    ]
  },
  {
    "version": "0.2.0",
    "slug": "v0-2-0-layout-overhaul-achievements",
    "date": "2025-11-09",
    "title": "v1.0.0 — Start Page, Layout Overhaul, Achievements, and Notoriety Stores",
    "description": "Major update introducing a new unified layout, achievements system, and revamped upgrade stores to enhance gameplay and user experience.",
    "changes": [
      "Implemented new unified layout with desktop sidebar and mobile slide-up bottom nav",
      "Achievements tab added next to Themes with placeholder trophies (per save slot)",
      "Split Upgrades tab into Cred Store and Notoriety Store sections",
      "Applied monospace fonts to all stat and currency values",
      "Introduced theme support for custom fonts, background, and icon images",
      "Added Buy Me a Coffee donation link in Settings",
      "Prestige threshold lowered to 1e7, preserving Themes, Infinite upgrades, and Achievements",
      "Random events rebalanced to occur roughly every 10 minutes",
      "Improved ×10 purchase feedback and disabled state"
    ]
  }
]
